IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC3_CFG_CONTROLSS_ADC3_CFG.xml
	<register id="CONTROLSS_ADC3_CFG_ADCINTFLGCLR" acronym="CONTROLSS_ADC3_CFG_ADCINTFLGCLR" offset="0x8" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT4 and ADCINT4RESULT flags in the ADCINTFLG register.  If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT3 and ADCINT3RESULT flags in the ADCINTFLG register.   If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT2 and ADCINT2RESULT flags in the ADCINTFLG register. . If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT1 and ADCINT1RESULT flags in the ADCINTFLG register.  If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCINTOVF" acronym="CONTROLSS_ADC3_CFG_ADCINTOVF" offset="0xA" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="3" rwaccess="RO"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="2" rwaccess="RO"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="1" rwaccess="RO"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCINTOVFCLR" acronym="CONTROLSS_ADC3_CFG_ADCINTOVFCLR" offset="0xC" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCINTSEL1N2" acronym="CONTROLSS_ADC3_CFG_ADCINTSEL1N2" offset="0xE" width="16" description="">
		<bitfield id="INT2CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT2 Continue to Interrupt Mode   0  No further ADCINT2 pulses are generated until ADCINT2 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT2E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT2 Interrupt Enable   0  ADCINT2 is disabled   1  ADCINT2 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT2SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT2 EOC Source Select   0h  EOC0 is trigger for ADCINT2   1h  EOC1 is trigger for ADCINT2   2h  EOC2 is trigger for ADCINT2   3h  EOC3 is trigger for ADCINT2   4h  EOC4 is trigger for ADCINT2   5h  EOC5 is trigger for ADCINT2   6h  EOC6 is trigger for ADCINT2   7h  EOC7 is trigger for ADCINT2   8h  EOC8 is trigger for ADCINT2   9h  EOC9 is trigger for ADCINT2   Ah  EOC10 is trigger for ADCINT2   Bh  EOC11 is trigger for ADCINT2   Ch  EOC12 is trigger for ADCINT2   Dh  EOC13 is trigger for ADCINT2   Eh  EOC14 is trigger for ADCINT2   Fh  EOC15 is trigger for ADCINT2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT1CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT1 Continue to Interrupt Mode   0  No further ADCINT1 pulses are generated until ADCINT1 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT1E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT1 Interrupt Enable   0  ADCINT1 is disabled   1  ADCINT1 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT1SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT1 EOC Source Select   0h  EOC0 is trigger for ADCINT1   1h  EOC1 is trigger for ADCINT1   2h  EOC2 is trigger for ADCINT1   3h  EOC3 is trigger for ADCINT1   4h  EOC4 is trigger for ADCINT1   5h  EOC5 is trigger for ADCINT1   6h  EOC6 is trigger for ADCINT1   7h  EOC7 is trigger for ADCINT1   8h  EOC8 is trigger for ADCINT1   9h  EOC9 is trigger for ADCINT1   Ah  EOC10 is trigger for ADCINT1   Bh  EOC11 is trigger for ADCINT1   Ch  EOC12 is trigger for ADCINT1   Dh  EOC13 is trigger for ADCINT1   Eh  EOC14 is trigger for ADCINT1   Fh  EOC15 is trigger for ADCINT1" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCINTSEL3N4" acronym="CONTROLSS_ADC3_CFG_ADCINTSEL3N4" offset="0x10" width="16" description="">
		<bitfield id="INT4CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT4 Continue to Interrupt Mode   0  No further ADCINT4 pulses are generated until ADCINT4 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT4E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT4 Interrupt Enable   0  ADCINT4 is disabled   1  ADCINT4 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT4SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT4 EOC Source Select   0h  EOC0 is trigger for ADCINT4   1h  EOC1 is trigger for ADCINT4   2h  EOC2 is trigger for ADCINT4   3h  EOC3 is trigger for ADCINT4   4h  EOC4 is trigger for ADCINT4   5h  EOC5 is trigger for ADCINT4   6h  EOC6 is trigger for ADCINT4   7h  EOC7 is trigger for ADCINT4   8h  EOC8 is trigger for ADCINT4   9h  EOC9 is trigger for ADCINT4   Ah  EOC10 is trigger for ADCINT4   Bh  EOC11 is trigger for ADCINT4   Ch  EOC12 is trigger for ADCINT4   Dh  EOC13 is trigger for ADCINT4   Eh  EOC14 is trigger for ADCINT4   Fh  EOC15 is trigger for ADCINT4" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT3CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT3 Continue to Interrupt Mode   0  No further ADCINT3 pulses are generated until ADCINT3 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT3E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT3 Interrupt Enable   0  ADCINT3 is disabled   1  ADCINT3 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT3SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT3 EOC Source Select   0h  EOC0 is trigger for ADCINT3   1h  EOC1 is trigger for ADCINT3   2h  EOC2 is trigger for ADCINT3   3h  EOC3 is trigger for ADCINT3   4h  EOC4 is trigger for ADCINT3   5h  EOC5 is trigger for ADCINT3   6h  EOC6 is trigger for ADCINT3   7h  EOC7 is trigger for ADCINT3   8h  EOC8 is trigger for ADCINT3   9h  EOC9 is trigger for ADCINT3   Ah  EOC10 is trigger for ADCINT3   Bh  EOC11 is trigger for ADCINT3   Ch  EOC12 is trigger for ADCINT3   Dh  EOC13 is trigger for ADCINT3   Eh  EOC14 is trigger for ADCINT3   Fh  EOC15 is trigger for ADCINT3" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOCPRICTL" acronym="CONTROLSS_ADC3_CFG_ADCSOCPRICTL" offset="0x12" width="16" description="">
		<bitfield id="RRPOINTER" width="5" begin="9" end="5" resetval="0x16" description="Round Robin Pointer. Holds the value of the last converted round robin SOCx to be used by the round robin scheme to determine order of conversions.   00h  SOC0 was last round robin SOC to convert, SOC1 is highest round robin priority.   01h  SOC1 was last round robin SOC to convert, SOC2 is highest round robin priority.   02h  SOC2 was last round robin SOC to convert, SOC3 is highest round robin priority.   03h  SOC3 was last round robin SOC to convert, SOC4 is highest round robin priority.   04h  SOC4 was last round robin SOC to convert, SOC5 is highest round robin priority.   05h  SOC5 was last round robin SOC to convert, SOC6 is highest round robin priority.   06h  SOC6 was last round robin SOC to convert, SOC7 is highest round robin priority.   07h  SOC7 was last round robin SOC to convert, SOC8 is highest round robin priority.   08h  SOC8 was last round robin SOC to convert, SOC9 is highest round robin priority.   09h  SOC9 was last round robin SOC to convert, SOC10 is highest round robin priority.   0Ah  SOC10 was last round robin SOC to convert, SOC11 is highest round robin priority.   0Bh  SOC11 was last round robin SOC to convert, SOC12 is highest round robin priority.   0Ch  SOC12 was last round robin SOC to convert, SOC13 is highest round robin priority.   0Dh  SOC13 was last round robin SOC to convert, SOC14 is highest round robin priority.   0Eh  SOC14 was last round robin SOC to convert, SOC15 is highest round robin priority.   0Fh  SOC15 was last round robin SOC to convert, SOC0 is highest round robin priority.   10h  Reset value to indicate no SOC has been converted. SOC0 is highest round robin priority. Set to this value when the device is reset, when the ADCCTL1.RESET bit is set, or when the ADCSOCPRICTL register is written. In the latter case, if a conversion is currently in progress, it will complete and then the new priority will take effect. Others  Invalid value." range="9 - 5" rwaccess="RO"/> 
		<bitfield id="SOCPRIORITY" width="5" begin="4" end="0" resetval="0x0" description="SOC Priority Determines the cutoff point for priority mode and round robin arbitration for SOCx   00h  SOC priority is handled in round robin mode for all channels.   01h  SOC0 is high priority, rest of channels are in round robin mode.   02h  SOC0-SOC1 are high priority, SOC2-SOC15 are in round robin mode.   03h  SOC0-SOC2 are high priority, SOC3-SOC15 are in round robin mode.   04h  SOC0-SOC3 are high priority, SOC4-SOC15 are in round robin mode.   05h  SOC0-SOC4 are high priority, SOC5-SOC15 are in round robin mode.   06h  SOC0-SOC5 are high priority, SOC6-SOC15 are in round robin mode.   07h  SOC0-SOC6 are high priority, SOC7-SOC15 are in round robin mode.   08h  SOC0-SOC7 are high priority, SOC8-SOC15 are in round robin mode.   09h  SOC0-SOC8 are high priority, SOC9-SOC15 are in round robin mode.   0Ah  SOC0-SOC9 are high priority, SOC10-SOC15 are in round robin mode.   0Bh  SOC0-SOC10 are high priority, SOC11-SOC15 are in round robin mode.   0Ch  SOC0-SOC11 are high priority, SOC12-SOC15 are in round robin mode.   0Dh  SOC0-SOC12 are high priority, SOC13-SOC15 are in round robin mode.   0Eh  SOC0-SOC13 are high priority, SOC14-SOC15 are in round robin mode.   0Fh  SOC0-SOC14 are high priority, SOC15 is in round robin mode.   10h  All SOCs are in high priority mode, arbitrated by SOC number. Others  Invalid selection." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCINTSOCSEL1" acronym="CONTROLSS_ADC3_CFG_ADCINTSOCSEL1" offset="0x14" width="16" description="">
		<bitfield id="SOC7" width="2" begin="15" end="14" resetval="0x0" description="SOC7 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC7. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC7. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC7.   10  ADCINT2 will trigger SOC7.   11  Invalid selection." range="15 - 14" rwaccess="RW"/> 
		<bitfield id="SOC6" width="2" begin="13" end="12" resetval="0x0" description="SOC6 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC6. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC6. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC6.   10  ADCINT2 will trigger SOC6.   11  Invalid selection." range="13 - 12" rwaccess="RW"/> 
		<bitfield id="SOC5" width="2" begin="11" end="10" resetval="0x0" description="SOC5 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC5. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC5. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC5.   10  ADCINT2 will trigger SOC5.   11  Invalid selection." range="11 - 10" rwaccess="RW"/> 
		<bitfield id="SOC4" width="2" begin="9" end="8" resetval="0x0" description="SOC4 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC4. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC4. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC4.   10  ADCINT2 will trigger SOC4.   11  Invalid selection." range="9 - 8" rwaccess="RW"/> 
		<bitfield id="SOC3" width="2" begin="7" end="6" resetval="0x0" description="SOC3 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC3. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC3. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC3.   10  ADCINT2 will trigger SOC3.   11  Invalid selection." range="7 - 6" rwaccess="RW"/> 
		<bitfield id="SOC2" width="2" begin="5" end="4" resetval="0x0" description="SOC2 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC2. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC2. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC2.   10  ADCINT2 will trigger SOC2.   11  Invalid selection." range="5 - 4" rwaccess="RW"/> 
		<bitfield id="SOC1" width="2" begin="3" end="2" resetval="0x0" description="SOC1 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC1. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC1. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC1.   10  ADCINT2 will trigger SOC1.   11  Invalid selection." range="3 - 2" rwaccess="RW"/> 
		<bitfield id="SOC0" width="2" begin="1" end="0" resetval="0x0" description="SOC0 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC0. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC0. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC0.   10  ADCINT2 will trigger SOC0.   11  Invalid selection." range="1 - 0" rwaccess="RW"/>
	</register>
