IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC3_CFG_CONTROLSS_ADC3_CFG.xml
	<register id="CONTROLSS_ADC3_CFG_ADCSOC8CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC8CTL" offset="0x40" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC8 Trigger Source Select. Along with the SOC8 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC8 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC8 Channel Select. Selects the channel to be converted when SOC8 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC8 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOC9CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC9CTL" offset="0x44" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC9 Trigger Source Select. Along with the SOC9 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC9 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC9 Channel Select. Selects the channel to be converted when SOC9 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC9 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOC10CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC10CTL" offset="0x48" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC10 Trigger Source Select. Along with the SOC10 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC10 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC10 Channel Select. Selects the channel to be converted when SOC10 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC10 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOC11CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC11CTL" offset="0x4C" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC11 Trigger Source Select. Along with the SOC11 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC11 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC11 Channel Select. Selects the channel to be converted when SOC11 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC11 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOC12CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC12CTL" offset="0x50" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC12 Trigger Source Select. Along with the SOC12 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC12 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC12 Channel Select. Selects the channel to be converted when SOC12 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC12 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC3_CFG_ADCSOC13CTL" acronym="CONTROLSS_ADC3_CFG_ADCSOC13CTL" offset="0x54" width="32" description="">
		<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC13 Trigger Source Select. Along with the SOC13 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC13 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.   00h - 7Fh: See AM602 Spec. for trigger defintion" range="26 - 20" rwaccess="RW"/> 
		<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC13 Channel Select. Selects the channel to be converted when SOC13 is received by the ADC.    00h  ADCIN0   01h  ADCIN1   02h  ADCIN2   03h  ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31" range="19 - 15" rwaccess="RW"/> 
		<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC13 Acquisition Prescale. Controls the sample and hold window for this SOC. The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The device datasheet will also specify a minimum sample and hold window duration.    000h  Sample window is 1 system clock cycle wide   001h  Sample window is 2 system clock cycles wide   002h  Sample window is 3 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide" range="8 - 0" rwaccess="RW"/>
	</register>
